1) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/Application.php:43    [M] Foreach_
--- Original
+++ New
@@ @@
-            foreach ($route->getOperations() as $operation) {
+            foreach (array() as $operation) {

PHPUnit 6.5.8 by Sebastian Bergmann and contributors.

F                                                                   1 / 1 (100%)

Time: 42 ms, Memory: 4.00MB

There was 1 failure:

1) ApiMockery\Tests\ApplicationTest::testRegisterResponseHandler
Expectation failed for method name is equal to "map" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

2) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/Application.php:40    [M] Foreach_
--- Original
+++ New
@@ @@
-        foreach ($routes as $route) {
+        foreach (array() as $route) {

PHPUnit 6.5.8 by Sebastian Bergmann and contributors.

F                                                                   1 / 1 (100%)

Time: 43 ms, Memory: 4.00MB

There was 1 failure:

1) ApiMockery\Tests\ApplicationTest::testRegisterResponseHandler
Expectation failed for method name is equal to "map" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

3) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/Application.php:38    [M] PublicVisibility
--- Original
+++ New
@@ @@
-    public function setup(array $routes)
+    protected function setup(array $routes)

PHPUnit 6.5.8 by Sebastian Bergmann and contributors.

E                                                                   1 / 1 (100%)

Time: 46 ms, Memory: 2.00MB

There was 1 error:

1) ApiMockery\Tests\ApplicationTest::testRegisterResponseHandler
Error: Call to protected method ApiMockery\Application::setup() from context 'ApiMockery\Tests\ApplicationTest'

/Volumes/webroot/Workspace/ApiDev/ApiMockery/tests/ApiMockery/ApplicationTest.php:62

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

4) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/Dto/Operation.php:58    [M] PublicVisibility
--- Original
+++ New
@@ @@
-    public function getOperationId() : string
+    protected function getOperationId() : string

PHPUnit 6.5.8 by Sebastian Bergmann and contributors.

..E                                                                 3 / 3 (100%)

Time: 44 ms, Memory: 2.00MB

There was 1 error:

1) ApiMockery\Tests\Config\Swagger\V2Test::testParseOneEndPoint
Error: Call to protected method ApiMockery\Dto\Operation::getOperationId() from context 'ApiMockery\Tests\Config\Swagger\V2Test'

/Volumes/webroot/Workspace/ApiDev/ApiMockery/tests/ApiMockery/Config/Swagger/V2Test.php:117

ERRORS!
Tests: 3, Assertions: 10, Errors: 1.

5) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/Dto/Operation.php:66    [M] PublicVisibility
--- Original
+++ New
@@ @@
-    public function getProduces() : array
+    protected function getProduces() : array

PHPUnit 6.5.8 by Sebastian Bergmann and contributors.

..E                                                                 3 / 3 (100%)

Time: 45 ms, Memory: 2.00MB

There was 1 error:

1) ApiMockery\Tests\Config\Swagger\V2Test::testParseOneEndPoint
Error: Call to protected method ApiMockery\Dto\Operation::getProduces() from context 'ApiMockery\Tests\Config\Swagger\V2Test'

/Volumes/webroot/Workspace/ApiDev/ApiMockery/tests/ApiMockery/Config/Swagger/V2Test.php:115

ERRORS!
Tests: 3, Assertions: 8, Errors: 1.

6) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/Dto/Operation.php:74    [M] PublicVisibility
--- Original
+++ New
@@ @@
-    public function getType() : string
+    protected function getType() : string

PHPUnit 6.5.8 by Sebastian Bergmann and contributors.

..E

Time: 47 ms, Memory: 4.00MB

There was 1 error:

1) ApiMockery\Tests\Config\Swagger\V2Test::testParseOneEndPoint
Error: Call to protected method ApiMockery\Dto\Operation::getType() from context 'ApiMockery\Tests\Config\Swagger\V2Test'

/Volumes/webroot/Workspace/ApiDev/ApiMockery/tests/ApiMockery/Config/Swagger/V2Test.php:116

ERRORS!
Tests: 3, Assertions: 9, Errors: 1.

7) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/Dto/Operation.php:82    [M] PublicVisibility
--- Original
+++ New
@@ @@
-    public function getResponseHandler() : string
+    protected function getResponseHandler() : string

PHPUnit 6.5.8 by Sebastian Bergmann and contributors.

..E                                                                 3 / 3 (100%)

Time: 42 ms, Memory: 2.00MB

There was 1 error:

1) ApiMockery\Tests\Config\Swagger\V2Test::testParseOneEndPoint
Error: Call to protected method ApiMockery\Dto\Operation::getResponseHandler() from context 'ApiMockery\Tests\Config\Swagger\V2Test'

/Volumes/webroot/Workspace/ApiDev/ApiMockery/tests/ApiMockery/Config/Swagger/V2Test.php:119

ERRORS!
Tests: 3, Assertions: 12, Errors: 1.

8) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/Dto/Operation.php:90    [M] PublicVisibility
--- Original
+++ New
@@ @@
-    public function getResponseHandlerType() : string
+    protected function getResponseHandlerType() : string

PHPUnit 6.5.8 by Sebastian Bergmann and contributors.

..E                                                                 3 / 3 (100%)

Time: 51 ms, Memory: 2.00MB

There was 1 error:

1) ApiMockery\Tests\Config\Swagger\V2Test::testParseOneEndPoint
Error: Call to protected method ApiMockery\Dto\Operation::getResponseHandlerType() from context 'ApiMockery\Tests\Config\Swagger\V2Test'

/Volumes/webroot/Workspace/ApiDev/ApiMockery/tests/ApiMockery/Config/Swagger/V2Test.php:118

ERRORS!
Tests: 3, Assertions: 11, Errors: 1.

9) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/Dto/Path.php:37    [M] PublicVisibility
--- Original
+++ New
@@ @@
-    public function getOperations() : array
+    protected function getOperations() : array

PHPUnit 6.5.8 by Sebastian Bergmann and contributors.

..E

Time: 44 ms, Memory: 4.00MB

There was 1 error:

1) ApiMockery\Tests\Config\Swagger\V2Test::testParseOneEndPoint
Error: Call to protected method ApiMockery\Dto\Path::getOperations() from context 'ApiMockery\Tests\Config\Swagger\V2Test'

/Volumes/webroot/Workspace/ApiDev/ApiMockery/tests/ApiMockery/Config/Swagger/V2Test.php:112

ERRORS!
Tests: 3, Assertions: 7, Errors: 1.

10) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/Dto/Path.php:42    [M] PublicVisibility
--- Original
+++ New
@@ @@
-    public function getBaseUrl() : string
+    protected function getBaseUrl() : string

PHPUnit 6.5.8 by Sebastian Bergmann and contributors.

..E

Time: 47 ms, Memory: 4.00MB

There was 1 error:

1) ApiMockery\Tests\Config\Swagger\V2Test::testParseOneEndPoint
Error: Call to protected method ApiMockery\Dto\Path::getBaseUrl() from context 'ApiMockery\Tests\Config\Swagger\V2Test'

/Volumes/webroot/Workspace/ApiDev/ApiMockery/tests/ApiMockery/Config/Swagger/V2Test.php:110

ERRORS!
Tests: 3, Assertions: 6, Errors: 1.

1) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/Application.php:59    [M] LogicalNot

--- Original
+++ New
@@ @@
-            if (!\is_array($args)) {
+            if (\is_array($args)) {

2) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/Application.php:56    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
-    protected function getOperationClosure(Operation $operation) : \Closure
+    private function getOperationClosure(Operation $operation) : \Closure

3) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/AbstractResponseHandler.php:51    [M] PublicVisibility

--- Original
+++ New
@@ @@
-    public function getBasePath() : string
+    protected function getBasePath() : string

4) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/AbstractResponseHandler.php:56    [M] PublicVisibility

--- Original
+++ New
@@ @@
-    public function getOperation() : Operation
+    protected function getOperation() : Operation

5) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/AbstractResponseHandler.php:64    [M] PublicVisibility

--- Original
+++ New
@@ @@
-    public function getRelevantMimeTypes() : array
+    protected function getRelevantMimeTypes() : array

6) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/AbstractResponseHandler.php:72    [M] PublicVisibility

--- Original
+++ New
@@ @@
-    public function setRelevantMimeTypes(array $relevantMimeTypes) : void
+    protected function setRelevantMimeTypes(array $relevantMimeTypes) : void

7) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/AbstractResponseHandler.php:82    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
-    protected function writeRespond(ResponseInterface $response, int $statusCode, string $contentType, string $body) : ResponseInterface
+    private function writeRespond(ResponseInterface $response, int $statusCode, string $contentType, string $body) : ResponseInterface

8) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:24    [M] PublicVisibility

--- Original
+++ New
@@ @@
-    public function execute(RequestInterface $request, ResponseInterface $response, array $args) : ResponseInterface
+    protected function execute(RequestInterface $request, ResponseInterface $response, array $args) : ResponseInterface

9) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:39    [M] TrueValue

--- Original
+++ New
@@ @@
-        if ($serverRequest->hasHeader(self::CONTENT_TYPE) === true) {
+        if ($serverRequest->hasHeader(self::CONTENT_TYPE) === false) {

10) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:39    [M] Identical

--- Original
+++ New
@@ @@
-        if ($serverRequest->hasHeader(self::CONTENT_TYPE) === true) {
+        if ($serverRequest->hasHeader(self::CONTENT_TYPE) !== true) {

11) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:41    [M] NotIdentical

--- Original
+++ New
@@ @@
-            if ($contentType !== null || $contentType !== '') {
+            if ($contentType === null || $contentType !== '') {

12) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:41    [M] NotIdentical

--- Original
+++ New
@@ @@
-            if ($contentType !== null || $contentType !== '') {
+            if ($contentType !== null || $contentType === '') {

13) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:41    [M] LogicalOr

--- Original
+++ New
@@ @@
-            if ($contentType !== null || $contentType !== '') {
+            if ($contentType !== null && $contentType !== '') {

14) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:47    [M] Identical

--- Original
+++ New
@@ @@
-        if ($this->getResponseContentType() === '') {
+        if ($this->getResponseContentType() !== '') {

15) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:37    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
-    protected function initResponseType(RequestInterface $serverRequest)
+    private function initResponseType(RequestInterface $serverRequest)

16) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:52    [M] PublicVisibility

--- Original
+++ New
@@ @@
-    public function getResponseContentType() : string
+    protected function getResponseContentType() : string

17) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:57    [M] PublicVisibility

--- Original
+++ New
@@ @@
-    public function setResponseContentType(string $responseContentType)
+    protected function setResponseContentType(string $responseContentType)

18) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:70    [M] FalseValue

--- Original
+++ New
@@ @@
-        if (preg_match_all("/{[^}]*}/", $responseHandlerPath, $matches) !== false) {
+        if (preg_match_all("/{[^}]*}/", $responseHandlerPath, $matches) !== true) {

19) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:70    [M] NotIdentical

--- Original
+++ New
@@ @@
-        if (preg_match_all("/{[^}]*}/", $responseHandlerPath, $matches) !== false) {
+        if (preg_match_all("/{[^}]*}/", $responseHandlerPath, $matches) === false) {

20) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:71    [M] DecrementInteger

--- Original
+++ New
@@ @@
-            foreach ($matches[0] as $match) {
+            foreach ($matches[-1] as $match) {

21) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:71    [M] OneZeroInteger

--- Original
+++ New
@@ @@
-            foreach ($matches[0] as $match) {
+            foreach ($matches[1] as $match) {

22) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:72    [M] IncrementInteger

--- Original
+++ New
@@ @@
-                $key = substr($match, 1, -1);
+                $key = substr($match, 2, -1);

23) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:72    [M] OneZeroInteger

--- Original
+++ New
@@ @@
-                $key = substr($match, 1, -1);
+                $key = substr($match, 0, -1);

24) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:72    [M] IncrementInteger

--- Original
+++ New
@@ @@
-                $key = substr($match, 1, -1);
+                $key = substr($match, 1, -2);

25) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:72    [M] OneZeroInteger

--- Original
+++ New
@@ @@
-                $key = substr($match, 1, -1);
+                $key = substr($match, 1, -0);

26) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:73    [M] LogicalNot

--- Original
+++ New
@@ @@
-                if (!array_key_exists($key, $args)) {
+                if (array_key_exists($key, $args)) {

27) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:74    [M] Throw_

--- Original
+++ New
@@ @@
-                    throw new \Exception(sprintf('Argument %s not in request.', $match));
+                    new \Exception(sprintf('Argument %s not in request.', $match));

28) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:71    [M] Foreach_

--- Original
+++ New
@@ @@
-            foreach ($matches[0] as $match) {
+            foreach (array() as $match) {

29) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:67    [M] PublicVisibility

--- Original
+++ New
@@ @@
-    public function getResponseFileName(string $responseHandlerPath, array $args)
+    protected function getResponseFileName(string $responseHandlerPath, array $args)

30) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:95    [M] TrueValue

--- Original
+++ New
@@ @@
-        if (file_exists($filePath) !== true) {
+        if (file_exists($filePath) !== false) {

31) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:95    [M] NotIdentical

--- Original
+++ New
@@ @@
-        if (file_exists($filePath) !== true) {
+        if (file_exists($filePath) === true) {

32) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:97    [M] Throw_

--- Original
+++ New
@@ @@
-            /** @todo add default api error response possbilty  * */
-            throw new \Exception(sprintf('Mock %s not found or readable.', $responseFileName));
+            new \Exception(sprintf('Mock %s not found or readable.', $responseFileName));

33) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:89    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
-    protected function writeFileRespond(ResponseInterface $response, string $responseFileName) : ResponseInterface
+    private function writeFileRespond(ResponseInterface $response, string $responseFileName) : ResponseInterface

34) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:107    [M] PublicVisibility

--- Original
+++ New
@@ @@
-    public function getResponseFileType() : string
+    protected function getResponseFileType() : string

35) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:142    [M] DecrementInteger

--- Original
+++ New
@@ @@
-                $statusCode = 404;
+                $statusCode = 403;

36) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:142    [M] IncrementInteger

--- Original
+++ New
@@ @@
-                $statusCode = 404;
+                $statusCode = 405;

37) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandler/FileResponseHandler.php:124    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
-    protected function getFileContentByPath(string $filePath) : array
+    private function getFileContentByPath(string $filePath) : array

39) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandlerFactory.php:45    [M] FalseValue

--- Original
+++ New
@@ @@
-        if (isset($this->responseHandler[$type]) === false) {
+        if (isset($this->responseHandler[$type]) === true) {

40) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandlerFactory.php:45    [M] Identical

--- Original
+++ New
@@ @@
-        if (isset($this->responseHandler[$type]) === false) {
+        if (isset($this->responseHandler[$type]) !== false) {

41) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandlerFactory.php:47    [M] Throw_

--- Original
+++ New
@@ @@
-            throw new ConfigurationMismatchException($msg);
+            new ConfigurationMismatchException($msg);

42) /Volumes/webroot/Workspace/ApiDev/ApiMockery/src/ApiMockery/ResponseHandlerFactory.php:41    [M] PublicVisibility

--- Original
+++ New
@@ @@
-    public function create(Operation $operation) : ResponseHandlerInterface
+    protected function create(Operation $operation) : ResponseHandlerInterface
